Revit 2027 API
DefaultOpenFromCloudCallback Methods
The DefaultOpenFromCloudCallback type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
OnOpenConflict |  A method called when the conflict is happen during the model opening.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DefaultOpenFromCloudCallback Class
Autodesk.Revit.DB Namespace